Dataset 'titanicfull.csv' terdiri atas 11 kolom:
pcalss: kelas tiket, terdiri atas 3 kategori yaitu 1, 2, dan 3
survived: kelas target, bernilai '0' jika penumpang meninggal dan '1' jika penumpang masih hidup setelah kecelakaan kapal Titanic
name: nama penumpang
sex: jenis kelamin
age: umur
sibsp: jumlah saudara atau pasangan
parch: jumlah orang tua
ticket: kode tiket
fare: harga tiket yang berhubungan dengan kelas tiket. Setiap kelas tiket memiliki interval harga tertentu. 
Cabin: kabin kapal
embarked: kode pelabuhan asal keberangkatan

Buatlah kode python untuk melakukan klasifikasi pada data 'titanicfull.csv'. Kelas target yaitu kolom 'survived'!
Anda harus melakukan pra-pemrosesan data agar data dapat diterima oleh sistem

1. Buat kode python untuk membaca data dari file  'titanicfull.csv' !

In [286]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import ExtraTreesClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split


pdf=pd.read_csv("titanicFull.csv")
pdf=pdf.iloc[1: , :]
col_names=['Class','Survived','Name','Sex','Age','SIBSP','Parch','Ticket',
           'Fare', 'Cabin', 'Embarked']
pdf.columns=col_names

col_names
pdf.head()

   Class  Survived  ...    Cabin Embarked
1      1         1  ...  C22 C26        S
2      1         0  ...  C22 C26        S
3      1         0  ...  C22 C26        S
4      1         0  ...  C22 C26        S
5      1         1  ...      E12        S

[5 rows x 11 columns]

2. Tampilkan informasi data dengan perintah dataframe.info()!

In [287]:
pdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1308 entries, 1 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Class     1308 non-null   int64
 1   Survived  1308 non-null   int64
 2   Name      1308 non-null   object
 3   Sex       1308 non-null   object
 4   Age       1045 non-null   float64
 5   SIBSP     1308 non-null   int64
 6   Parch     1308 non-null   int64
 7   Ticket    1308 non-null   object
 8   Fare      1307 non-null   float64
 9   Cabin     294 non-null    object
 10  Embarked  1306 non-null   object
dtypes: float64(2), int64(4), object(5)
memory usage: 112.5+ KB

3. Buat kode python untuk menampilkan nama kolom dari dataset tersebut!

In [288]:
pdf.columns

Index(['Class', 'Survived', 'Name', 'Sex', 'Age', 'SIBSP', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

4. Buat kode python untuk memeriksa apakah ada missing valus pada dataset!

In [289]:
pdf.isnull().sum()

Class          0
Survived       0
Name           0
Sex            0
Age          263
SIBSP          0
Parch          0
Ticket         0
Fare           1
Cabin       1014
Embarked       2
dtype: int64

3. Apakah terdapat kolom yang memiliki missing values lebih dari 30%? Jika ada maka buatlah kode python untuk menghapus kolom tersebut!

In [290]:
col_names1=pdf.columns[pdf.isnull().mean()<0.3]
col_names1

Index(['Class', 'Survived', 'Name', 'Sex', 'Age', 'SIBSP', 'Parch', 'Ticket',
       'Fare', 'Embarked'],
      dtype='object')

In [291]:
pdf1=pdf.drop(['Cabin'], axis=1)
pdf1.columns

Index(['Class', 'Survived', 'Name', 'Sex', 'Age', 'SIBSP', 'Parch', 'Ticket',
       'Fare', 'Embarked'],
      dtype='object')

4. Buat kode python untuk mengganti missing values pada kolom 'age' dengan median dari nilai kolom 'age'!

In [292]:
pdf1['Age'].fillna((pdf1["Age"].mean()),inplace=True)

5. Buat kode python untuk missing values pada kolom 'emberked' dengan mode dari nilai kolom 'embarked'!

In [293]:
pdf1['Embarked'].fillna(pdf1['Embarked'].mode()[0],inplace=True)

6. Buat kode python untuk menampilkan sampel dari dataset yang memiliki missing values pada kolom 'fare'!

In [294]:
pdf1.loc[pdf1['Fare'].isna()==True]

      Class  Survived                Name   Sex  ...  Parch  Ticket  Fare Embarked
1225      3         0  Storey, Mr. Thomas  male  ...      0    3701   NaN        S

[1 rows x 10 columns]

Pilih salah satu dari 2 metode berikut:

Harga tiket pada kolom 'fare' berhubungan dengan kelas tiket kolom 'pclass'. Setiap kelas tiket memiliki interval harga tiketyang berbeda. 

7(a) [Bonus 10 poin] Buat kode python untuk mengganti missing value pada kolom 'fare' sesuai dengan nilai mode dari harga tiket pada kelas tertentu. Misalnya sampel yang memiliki missing value kolom 'fare' memiliki nilai pclass = 3, maka missing value tersebut harus diisi dengan nilai mode dari harga tiket di kelas tersebut. 

7 (b) Buat kode python untuk mengganti missing value pada kolom 'fare' dengan nilai rata-rata dari harga tiket seluruh penumpang!

In [295]:
for col_names1 in  ['Fare']:
  pdf1[col_names1]=pdf1[col_names1].fillna(pdf1['Class'])

8. Buat kode python untuk memeriksa apakah masih ada missing values! Jika masih ada missing values, buat kode python untuk mengisi data yang tidak lengkap tersebut.

In [296]:
pdf1.isna().sum()

Class       0
Survived    0
Name        0
Sex         0
Age         0
SIBSP       0
Parch       0
Ticket      0
Fare        0
Embarked    0
dtype: int64

9. Tampilkan 5 sampel teratas setelah pra-pemrosesan data!

In [297]:
pdf1.head()

   Class  Survived  ...    Fare Embarked
1      1         1  ...  151.55        S
2      1         0  ...  151.55        S
3      1         0  ...  151.55        S
4      1         0  ...  151.55        S
5      1         1  ...   26.55        S

[5 rows x 10 columns]

10. Ganti nilai pada kolom 'sex' dengan male = 0 dan female = 1!

In [298]:
pdf1["Sex"]= pdf1['Sex'].map({'male':0, 'female':1}).astype(int)
pdf1

      Class  Survived  ...      Fare  Embarked
1         1         1  ...  151.5500         S
2         1         0  ...  151.5500         S
3         1         0  ...  151.5500         S
4         1         0  ...  151.5500         S
5         1         1  ...   26.5500         S
...     ...       ...  ...       ...       ...
1304      3         0  ...   14.4542         C
1305      3         0  ...   14.4542         C
1306      3         0  ...    7.2250         C
1307      3         0  ...    7.2250         C
1308      3         0  ...    7.8750         S

[1308 rows x 10 columns]

11. Ganti nilai pada kolom 'embarked' dengan S = 1, C = 2, Q = 3!

In [299]:
pdf1["Embarked"]=pdf1['Embarked'].map({'S':1,'C':2,'Q':3}).astype(int)
pdf1

      Class  Survived  ...      Fare  Embarked
1         1         1  ...  151.5500         1
2         1         0  ...  151.5500         1
3         1         0  ...  151.5500         1
4         1         0  ...  151.5500         1
5         1         1  ...   26.5500         1
...     ...       ...  ...       ...       ...
1304      3         0  ...   14.4542         2
1305      3         0  ...   14.4542         2
1306      3         0  ...    7.2250         2
1307      3         0  ...    7.2250         2
1308      3         0  ...    7.8750         1

[1308 rows x 10 columns]

12. Tentukan fitur dan kelas target dari dataset tersebut, kemudian simpan fitur dalam variabel X dan kelas target dalam variabel Y.

Kolom nama dan kode tiket tidak digunakan.

In [300]:
x= pdf1.drop(['Name','Ticket','Survived','Class'], axis=1)
y=pdf1['Survived']

13. Bagi data menjadi data latih dan data uji, dengan komposisi 30% data uji!

In [301]:
x_train, x_test,y_train,y_test=train_test_split(x,y,test_size=0.3, random_state=10)

Pilih 3 classifier untuk membangun model klasifikasi (Logistic regression, Decision tree, k-nearest neighbor, neural network, ensemble method)

14. Buat kode python untuk membangun model klasifikasi (classifier 1)! Kemudian lakukan pelatihan menggunakan data latih!

In [302]:
clfRF=RandomForestClassifier(n_estimators=10)
clfRF=clfRF.fit(x_train, y_train)
clfRF.score(x_test, y_test)

0.7684478371501272

15. Buat kode python untuk melakukan pengujian model classifier 1 dengan data uji!

In [303]:
y_predict_RF=clfRF.predict(x_test)
from sklearn.metrics import accuracy_score
print('Model accuracy score: {0:0.4f}'.format(accuracy_score(y_test,y_predict_RF)))

Model accuracy score: 0.7684

16. Buat kode python untuk membangun model klasifikasi (classifier 2)! Kemudian lakukan pelatihan menggunakan data latih!

In [304]:
clfDF=DecisionTreeClassifier(max_depth=None, min_samples_split=2, random_state=0)
clfDF=clfDF.fit(x_train,y_train)

17. Buat kode python untuk melakukan pengujian model classifier 2 dengan data uji!

In [305]:
y_predict_DF=clfDF.predict(x_test)
print('Model accuracy score: {0:0.4f}'.format(accuracy_score(y_test,y_predict_DF)))

Model accuracy score: 0.7710

18. Buat kode python untuk membangun model klasifikasi (classifier 3)! Kemudian lakukan pelatihan menggunakan data latih!

In [306]:
from sklearn.model_selection import cross_val_score
from sklearn.datasets import load_iris
from sklearn.ensemble import AdaBoostClassifier
clfAB= AdaBoostClassifier(n_estimators=100)
clfAB.fit(x_train,y_train)
clfAB.score(x_test,y_test)

0.7913486005089059

19. Buat kode python untuk melakukan pengujian model classifier 3 dengan data uji!

In [307]:
y_predict_AB=clfAB.predict(x_test)
print('Model accuracy score: {0:0.4f}'.format(accuracy_score(y_test,y_predict_AB)))

Model accuracy score: 0.7913

20. Buat kode python untuk menghitung akurasi dari classifier 1, 2 dan 3!

In [308]:
print('Random Forest Classifier Model accuracy score: {0:0.4f}'.format(accuracy_score(y_test,y_predict_RF)))
print('Decision Tree Classifier Model accuracy score: {0:0.4f}'.format(accuracy_score(y_test,y_predict_DF)))
print('Adaboost Classifier Model accuracy score: {0:0.4f}'.format(accuracy_score(y_test,y_predict_AB)))

Random Forest Classifier Model accuracy score: 0.7684
Decision Tree Classifier Model accuracy score: 0.7710
Adaboost Classifier Model accuracy score: 0.7913

21. Manakah di antara 3 classifier yang menghasilkan akurasi tertinggi dan terendah?

Dari ketiga classifier yang telah diuji, Adaboost Classifier Model paling tinggi tingkat akurasinya sedangkan paling rendah adalah Random Forest Classifier

22. Buat kode python untuk menghitung confusion matrix dari 3 classifier yang Anda gunakan!

In [309]:
from sklearn.metrics import confusion_matrix
from sklearn.metrics import classification_report

cm1=confusion_matrix(y_test,y_predict_RF)
cm2= confusion_matrix(y_test,y_predict_DF)
cm3=confusion_matrix(y_test,y_predict_AB)

print("Random Forest Classifier Model")
print(classification_report(y_test,y_predict_RF),'\n')

print("Decision Tree Classifier Model")
print(classification_report(y_test,y_predict_DF),'\n')

print("Adaboost Classifier Model")
print(classification_report(y_test,y_predict_AB))

Random Forest Classifier Model
              precision    recall  f1-score   support

           0       0.79      0.85      0.82       239
           1       0.73      0.65      0.69       154

    accuracy                           0.77       393
   macro avg       0.76      0.75      0.75       393
weighted avg       0.77      0.77      0.77       393


Decision Tree Classifier Model
              precision    recall  f1-score   support

           0       0.81      0.82      0.81       239
           1       0.71      0.70      0.71       154

    accuracy                           0.77       393
   macro avg       0.76      0.76      0.76       393
weighted avg       0.77      0.77      0.77       393


Adaboost Classifier Model
              precision    recall  f1-score   support

           0       0.81      0.86      0.83       239
           1       0.76      0.69      0.72       154

    accuracy                           0.79       393
   macro avg       0.78      0.77      0.78       393
weighted avg       0.79      0.79      0.79       393